using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace TH.Demo.VCPMC_Report.common
{
    public static class VnHelper
    {
        public static string RemoveUnicode(string text)
        {
            string[] arr1 = new string[] { "á", "à", "ả", "ã", "ạ", "â", "ấ", "ầ", "ẩ", "ẫ", "ậ", "ă", "ắ", "ằ", "ẳ", "ẵ", "ặ",
                "đ",
                "é","è","ẻ","ẽ","ẹ","ê","ế","ề","ể","ễ","ệ",
                "í","ì","ỉ","ĩ","ị",
                "ó","ò","ỏ","õ","ọ","ô","ố","ồ","ổ","ỗ","ộ","ơ","ớ","ờ","ở","ỡ","ợ",
                "ú","ù","ủ","ũ","ụ","ư","ứ","ừ","ử","ữ","ự",
                "ý","ỳ","ỷ","ỹ","ỵ",};
                        string[] arr2 = new string[] { "a", "a", "a", "a", "a", "a", "a", "a", "a", "a", "a", "a", "a", "a", "a", "a", "a",
                "d",
                "e","e","e","e","e","e","e","e","e","e","e",
                "i","i","i","i","i",
                "o","o","o","o","o","o","o","o","o","o","o","o","o","o","o","o","o",
                "u","u","u","u","u","u","u","u","u","u","u",
                "y","y","y","y","y",};
            for (int i = 0; i < arr1.Length; i++)
            {
                text = text.Replace(arr1[i], arr2[i]);
                text = text.Replace(arr1[i].ToUpper(), arr2[i].ToUpper());
            }
            return text;
        }
        public static string NonUnicode(this string text)
        {
            string[] arr1 = new string[] { "á", "à", "ả", "ã", "ạ", "â", "ấ", "ầ", "ẩ", "ẫ", "ậ", "ă", "ắ", "ằ", "ẳ", "ẵ", "ặ",
                "đ",
                "é","è","ẻ","ẽ","ẹ","ê","ế","ề","ể","ễ","ệ",
                "í","ì","ỉ","ĩ","ị",
                "ó","ò","ỏ","õ","ọ","ô","ố","ồ","ổ","ỗ","ộ","ơ","ớ","ờ","ở","ỡ","ợ",
                "ú","ù","ủ","ũ","ụ","ư","ứ","ừ","ử","ữ","ự",
                "ý","ỳ","ỷ","ỹ","ỵ",};
                        string[] arr2 = new string[] { "a", "a", "a", "a", "a", "a", "a", "a", "a", "a", "a", "a", "a", "a", "a", "a", "a",
                "d",
                "e","e","e","e","e","e","e","e","e","e","e",
                "i","i","i","i","i",
                "o","o","o","o","o","o","o","o","o","o","o","o","o","o","o","o","o",
                "u","u","u","u","u","u","u","u","u","u","u",
                "y","y","y","y","y",};
            for (int i = 0; i < arr1.Length; i++)
            {
                text = text.Replace(arr1[i], arr2[i]);
                text = text.Replace(arr1[i].ToUpper(), arr2[i].ToUpper());
            }
            return text;
        }
        public static bool Detect(string text)
        {
            //string[] arr1 = new string[] { 
            //    "á", "à", "ả", "ã", "ạ", 
            //    "Á", "À", "Ả", "Ã", "Ạ", 
            //    "â", "ấ", "ầ", "ẩ", "ẫ", "ậ", 
            //    "Â", "Ấ", "Ầ", "Ẩ", "Ẫ", "Ậ", 
            //    "ă", "ắ", "ằ", "ẳ", "ẵ", "ặ",
            //    "Ă", "Ắ", "Ằ", "Ẳ", "Ẵ", "Ặ",
            //    "đ",
            //    "Đ",
            //    "é","è","ẻ","ẽ","ẹ",
            //    "É","È","Ẻ","Ẽ","Ẹ",
            //    "ê","ế","ề","ể","ễ","ệ",
            //    "Ê","Ế","Ề","Ể","Ễ","Ệ",
            //    "í","ì","ỉ","ĩ","ị",
            //    "Í","Ì","Ỉ","Ĩ","Ị",
            //    "ó","ò","ỏ","õ","ọ",
            //    "Ó","Ò","Ỏ","Õ","Ọ",
            //    "ô","ố","ồ","ổ","ỗ","ộ",
            //    "Ô","Ố","Ồ","Ổ","Ỗ","Ộ",
            //    "ơ","ớ","ờ","ở","ỡ","ợ",
            //    "Ơ","Ớ","Ờ","Ở","Ỡ","Ợ",
            //    "ú","ù","ủ","ũ","ụ",
            //    "Ú","Ù","Ủ","Ũ","Ụ",
            //    "ư","ứ","ừ","ử","ữ","ự",
            //    "Ư","Ứ","Ừ","Ử","Ữ","Ự",
            //    "ý","ỳ","ỷ","ỹ","ỵ",
            //    "Ý","Ỳ","Ỷ","Ỹ","Ỵ",
            //};

            char[] arr1 = new char[] {
             'á', 'à', 'ả', 'ã', 'ạ',
                'Á', 'À', 'Ả', 'Ã', 'Ạ',
                'â', 'ấ', 'ầ', 'ẩ', 'ẫ', 'ậ',
                'Â', 'Ấ', 'Ầ', 'Ẩ', 'Ẫ', 'Ậ',
                'ă', 'ắ', 'ằ', 'ẳ', 'ẵ', 'ặ',
                'Ă', 'Ắ', 'Ằ', 'Ẳ', 'Ẵ', 'Ặ',
                'đ',
                'Đ',
                'é','è','ẻ','ẽ','ẹ',
                'É','È','Ẻ','Ẽ','Ẹ',
                'ê','ế','ề','ể','ễ','ệ',
                'Ê','Ế','Ề','Ể','Ễ','Ệ',
                'í','ì','ỉ','ĩ','ị',
                'Í','Ì','Ỉ','Ĩ','Ị',
                'ó','ò','ỏ','õ','ọ',
                'Ó','Ò','Ỏ','Õ','Ọ',
                'ô','ố','ồ','ổ','ỗ','ộ',
                'Ô','Ố','Ồ','Ổ','Ỗ','Ộ',
                'ơ','ớ','ờ','ở','ỡ','ợ',
                'Ơ','Ớ','Ờ','Ở','Ỡ','Ợ',
                'ú','ù','ủ','ũ','ụ',
                'Ú','Ù','Ủ','Ũ','Ụ',
                'ư','ứ','ừ','ử','ữ','ự',
                'Ư','Ứ','Ừ','Ử','Ữ','Ự',
                'ý','ỳ','ỷ','ỹ','ỵ',
                'Ý','Ỳ','Ỷ','Ỹ','Ỵ',
            };

            for (int i = 0; i < text.Length; i++)
            {
                //char s = text[i];
                for (int j = 0; j < arr1.Length; j++)
                {
                    //char s1 = arr1[j];
                    if (text[i].Equals(arr1[j]))
                    {
                        return true;
                    }
                }
            }
            return false;
        }
    }
}
